tap "arthurk/virt-manager"
tap "bramstein/webfonttools"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
brew "ack"
brew "act"
brew "glib"
brew "xz"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "hdf5"
brew "armadillo"
brew "atk"
brew "atool"
brew "bash"
brew "bash-completion@2"
brew "node"
brew "bash-language-server"
brew "bat"
brew "protobuf"
brew "bear"
brew "bfg"
brew "binutils"
brew "numpy", link: false
brew "p7zip"
brew "pillow", link: false
brew "binwalk"
brew "blueutil"
brew "boost"
brew "bottom"
brew "brew-cask-completion"
brew "brightness"
brew "btop"
brew "calcurse"
brew "coreutils"
brew "gnutls"
brew "emacs"
brew "cask"
brew "ccls"
brew "cifer"
brew "clang-format"
brew "cmake"
brew "openldap"
brew "curl"
brew "deno"
brew "dex2jar"
brew "diffutils"
brew "dns2tcp"
brew "docker"
brew "dooit"
brew "dotnet"
brew "duti"
brew "efm-langserver"
brew "eslint"
brew "exa"
brew "fasd"
brew "fastfetch"
brew "fd"
brew "feh"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fisher"
brew "woff2"
brew "fontforge"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "openssl@3"
brew "git-crypt"
brew "git-filter-repo"
brew "git-flow"
brew "git-lfs"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "glow"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnupg"
brew "gobject-introspection"
brew "graphene"
brew "grep"
brew "gsl"
brew "gtk+3"
brew "libpsl"
brew "libsoup"
brew "gstreamer"
brew "gtksourceview4"
brew "ical-buddy"
brew "ifstat"
brew "libomp"
brew "imagemagick"
brew "jq"
brew "jrnl"
brew "keychain"
brew "kompose"
brew "krb5"
brew "lazydocker"
brew "lazygit"
brew "libfido2"
brew "libnice"
brew "libosinfo"
brew "libpq"
brew "libsoup@2"
brew "libvirt", restart_service: true
brew "libxml2"
brew "llvm"
brew "lolcat"
brew "lsd"
brew "lsusb"
brew "lua"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "make"
brew "mas"
brew "moreutils"
brew "mysql-client"
brew "nmap"
brew "ripgrep"
brew "w3m"
brew "nb"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nnn"
brew "oh-my-posh"
brew "openssh"
brew "perl"
brew "php"
brew "zopfli"
brew "pigz"
brew "pngcheck"
brew "prettier"
brew "pv"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "qt@5", link: true
brew "quilt"
brew "ranger"
brew "rename"
brew "rlwrap"
brew "rust"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "socat"
brew "speedtest-cli"
brew "spice-gtk"
brew "spotify-tui"
brew "sql-language-server"
brew "ssh-copy-id"
brew "starship"
brew "subversion"
brew "switchaudio-osx"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "trash-cli"
brew "tree"
brew "vbindiff"
brew "vte3"
brew "wego"
brew "wget"
brew "wireguard-go"
brew "wtfutil"
brew "xclip"
brew "xmlformat"
brew "xpdf"
brew "yaml-language-server"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "felixkratz/formulae/fyabai", args: ["HEAD"], link: false
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
brew "khanhas/tap/spicetify-cli"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "authy"
cask "caprine"
cask "cutter"
cask "discord"
cask "electron"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "kitty"
cask "monitorcontrol"
cask "moonlight"
cask "powershell"
cask "sf-symbols"
cask "skim"
cask "sloth"
cask "squirrel"
cask "stats"
cask "visual-studio-code"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Diffusers", id: 1666309574
mas "Fluent Reader", id: 1520907427
mas "iShot", id: 1485844094
mas "Manico", id: 724472954
mas "MWeb", id: 1183407767
mas "Numbers 表格", id: 409203825
mas "OpenCat", id: 6445999201
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "ServerCat", id: 1501532023
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "微信", id: 836500024
mas "超级右键", id: 1497428978
vscode "13xforever.language-x86-64-assembly"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adam-bender.commit-message-editor"
vscode "adpyke.codesnap"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "aksharpatel47.vscode-flutter-helper"
vscode "Alan.stylus"
vscode "albymor.increment-selection"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alexisvt.flutter-snippets"
vscode "aliariff.auto-add-brackets"
vscode "amandeepmittal.pug"
vscode "andys8.jest-snippets"
vscode "AntonioRodrguezRuiz.vscode-pugrender-template-literal"
vscode "anweber.statusbar-commands"
vscode "Asuka.insertnumbers"
vscode "awesomektvn.toggle-semicolon"
vscode "benjpas.close-all"
vscode "berublan.vscode-log-viewer"
vscode "bibhasdn.git-easy"
vscode "bibhasdn.unique-lines"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.print-it"
vscode "bmd.stm32-for-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Bruce.comments-wiper"
vscode "buianhthang.xml2json"
vscode "caolin.java-run"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chunsen.bracket-select"
vscode "clarkyu.vscode-sql-beautify"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "ctcuff.font-preview"
vscode "cwan.native-ascii-converter"
vscode "cybai.yaml-key-viewer"
vscode "dakara.dakara-foldplus"
vscode "dan-c-underwood.arm"
vscode "danileao.css-variables-autocomplete"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "Davidsekar.redis-xplorer"
vscode "davidwoo.flutter-auto-import"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "deerawan.vscode-faker"
vscode "dkultasev.vs-code-snippet-generator"
vscode "dongido.sync-env"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.javadebugger"
vscode "dotdevru.prettier-java"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "edag94.replacequotes"
vscode "EditorConfig.EditorConfig"
vscode "ElemeFE.vscode-element-helper"
vscode "EnskyLin.gitbook-shelf"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "erd0s.terraform-autocomplete"
vscode "ericadamski.carbon-now-sh"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "esskar.vscode-flutter-i18n-json"
vscode "everettjf.filter-line"
vscode "everettjf.pubspec-dependency-search"
vscode "fabiospampinato.vscode-todo-plus"
vscode "fernandoescolar.vscode-solution-explorer"
vscode "fishku.vant-snippets"
vscode "flpgdn.stringtosql"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "formulahendry.platformio"
vscode "funkyremi.vscode-google-translate"
vscode "gccfeli.vscode-lua"
vscode "geeebe.duplicate"
vscode "georgewfraser.vscode-javac"
vscode "GitHub.codespaces"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "giyyapan.fast-snippet"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "gornivv.vscode-flutter-files"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "GregorBiswanger.json2ts"
vscode "Gruntfuggly.todo-tree"
vscode "GulajavaMinistudio.complete-flutter-extension-pack"
vscode "GulajavaMinistudio.mayukaithemevsc"
vscode "gurayyarar.editorenhancements"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.terraform"
vscode "helixquar.randomeverything"
vscode "henriiik.docker-linter"
vscode "henriqueBruno.github-repository-manager"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "IWANABETHATGUY.vue-this-store"
vscode "JakeWilson.vscode-placeholder-images"
vscode "jakHuang.form-generator-plugin"
vscode "jakob101.RelativePath"
vscode "Janne252.fontawesome-autocomplete"
vscode "jasonnutter.search-node-modules"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeroen-meijer.pubspec-assist"
vscode "JerryHong.autofilename"
vscode "kameshkotwani.google-search"
vscode "kamikillerto.vscode-colorize"
vscode "kenhowardpdx.vscode-gist"
vscode "KishoreIthadi.dotnet-core-essentials"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ksmithut.plusplus"
vscode "Kuresaru.kstm32"
vscode "lior-chamla.google-fonts"
vscode "luongnd.edge"
vscode "marcelovelasquez.flutter-tree"
vscode "marcostazi.VS-code-vagrantfile"
vscode "marus25.cortex-debug"
vscode "maurodesouza.vscode-simple-readme"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.rtos-views"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "metaseed.metago"
vscode "metaseed.MetaJump"
vscode "metaseed.MetaWord"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "milkmidi.vs-code-quick-require"
vscode "mkxml.vscode-filesize"
vscode "mlewand.select-part-of-word"
vscode "mongodb.mongodb-vscode"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.mssql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mwpb.java-prettier-formatter"
vscode "Nash.awesome-flutter-snippets"
vscode "nathanchapman.javascriptsnippets"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "NicholasHsiang.vscode-javascript-snippet"
vscode "nick-rudenko.back-n-forth"
vscode "nmrmsys.vscode-sql-formatter-mod"
vscode "nmsmith89.incrementor"
vscode "npclaudiu.vscode-gn"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "p1c2u.docker-compose"
vscode "pepri.subtitles-editor"
vscode "persidskiy.vscode-gnformat"
vscode "pflannery.vscode-versionlens"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "PKief.material-icon-theme"
vscode "PKief.material-product-icons"
vscode "platformio.platformio-ide"
vscode "plibither8.remove-comments"
vscode "plorefice.devicetree"
vscode "pnp.polacode"
vscode "Prisma.prisma"
vscode "QuentinGruber.dockerfiletemplate"
vscode "quicktype.quicktype"
vscode "ramyaraoa.sass-helper"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ricardo-emerson.base-development-extensions-pack"
vscode "ritwickdey.LiveServer"
vscode "rocketseat.theme-omni"
vscode "royaction.color-manager"
vscode "rubbersheep.gi"
vscode "ryu1kn.partial-diff"
vscode "sburg.vscode-javascript-booster"
vscode "sdras.night-owl"
vscode "sdras.vue-vscode-extensionpack"
vscode "sdras.vue-vscode-snippets"
vscode "sensourceinc.vscode-sql-beautify"
vscode "shanoor.vscode-nginx"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SimonSiefke.svg-preview"
vscode "sldobri.fantastical-vuejs-code"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-multiclip"
vscode "SS.element-ui-snippets"
vscode "stackbreak.comment-divider"
vscode "stylelint.vscode-stylelint"
vscode "sysoev.language-stylus"
vscode "TabNine.tabnine-vscode"
vscode "teerasej.nextflow-s-flutter-extension-pack"
vscode "tgreen7.vs-code-node-require"
vscode "thekarel.open-spec-file"
vscode "thisismanta.stylus-supremacy"
vscode "thomascsd.vscode-readme-pattern"
vscode "Tobias-Sekan.solutionextension"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tristanremy.mirage"
vscode "trixnz.vscode-lua"
vscode "twxs.cmake"
vscode "Tyriar.sort-lines"
vscode "TzachOvadia.todo-list"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vmsynkov.colonize"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "walkme.Java-extension-pack"
vscode "wayou.vscode-todo-highlight"
vscode "whtouche.vscode-js-console-utils"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "wmaurer.html2jade"
vscode "wmaurer.vscode-jumpy"
vscode "wmontalvo.vsc-jsonsnippets"
vscode "wmontalvo.vsc-meta-snippet"
vscode "wolray.any-swap"
vscode "xabikos.JavaScriptSnippets"
vscode "xaver.clang-format"
vscode "xdebug.php-debug"
vscode "yatki.vscode-surround"
vscode "YouMayCallMeV.vscode-java-saber"
vscode "yoyo930021.vuter"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "zfzackfrost.commentbars"
vscode "zhangpanchina.vant-code-snippets-for-vue"
vscode "zhuangtongfa.material-theme"
vscode "zitup.classnametocss"
vscode "ZixuanWang.linkerscript"
vscode "ziyasal.vscode-open-in-github"
vscode "znlh-yuyi.flutter-dependency-manager"
