tap "bramstein/webfonttools"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "khanhas/tap"
tap "romkatv/powerlevel10k"
tap "tenfar/formulae"
brew "ack"
brew "act"
brew "glib"
brew "xz"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "hdf5"
brew "armadillo"
brew "atk"
brew "atool"
brew "bash"
brew "bash-completion@2"
brew "node"
brew "bash-language-server"
brew "bat"
brew "protobuf"
brew "bear"
brew "bfg"
brew "binutils"
brew "p7zip"
brew "pillow", link: false
brew "binwalk"
brew "blueutil"
brew "boost"
brew "bottom"
brew "brew-cask-completion"
brew "brightness"
brew "btop"
brew "calcurse"
brew "coreutils"
brew "gnutls"
brew "cask"
brew "llvm"
brew "ccls"
brew "cifer"
brew "clang-format"
brew "cmake"
brew "openldap"
brew "curl"
brew "deno"
brew "dex2jar"
brew "diffutils"
brew "dns2tcp"
brew "docker"
brew "dooit"
brew "duti"
brew "efm-langserver"
brew "eslint"
brew "exa"
brew "fasd"
brew "fastfetch"
brew "fd"
brew "feh"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fisher"
brew "woff2"
brew "fontforge"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "openssl@3"
brew "git-crypt"
brew "git-filter-repo"
brew "git-flow"
brew "git-lfs"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "glow"
brew "gnu-getopt"
brew "gnu-tar"
brew "gnupg"
brew "gobject-introspection"
brew "graphene"
brew "grep"
brew "gsl"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-libav"
brew "libnice"
brew "gst-plugins-bad"
brew "gtk+3"
brew "libpsl"
brew "libsoup"
brew "gst-plugins-good"
brew "gst-plugins-ugly"
brew "ical-buddy"
brew "ifstat"
brew "libomp"
brew "imagemagick"
brew "jq"
brew "jrnl"
brew "keychain"
brew "krb5"
brew "lazydocker"
brew "lazygit"
brew "libfido2"
brew "libosinfo"
brew "libpq"
brew "libsoup@2"
brew "libxml2"
brew "lolcat"
brew "lsd"
brew "lsusb"
brew "lua"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "make"
brew "mas"
brew "moreutils"
brew "mysql-client"
brew "nmap"
brew "ripgrep"
brew "nb"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nnn"
brew "oh-my-posh"
brew "openssh"
brew "perl"
brew "php"
brew "zopfli"
brew "pigz"
brew "pngcheck"
brew "prettier"
brew "pv"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "quilt"
brew "ranger"
brew "rename"
brew "rlwrap"
brew "rust"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "socat"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "starship"
brew "subversion"
brew "switchaudio-osx"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "trash-cli"
brew "tree"
brew "vbindiff"
brew "vte3"
brew "wego"
brew "wget"
brew "wireguard-go"
brew "wtfutil"
brew "xclip"
brew "xmlformat"
brew "xpdf"
brew "yaml-language-server"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
brew "tenfar/formulae/skhd"
brew "tenfar/formulae/yabai"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "caprine"
cask "cutter"
cask "electron"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "kitty"
cask "lulu"
cask "monitorcontrol"
cask "sf-symbols"
cask "skim"
cask "sloth"
cask "squirrel"
cask "stats"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Fluent Reader", id: 1520907427
mas "iShot", id: 1485844094
mas "Manico", id: 724472954
mas "MWeb", id: 1183407767
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "QQ", id: 451108668
mas "ServerCat", id: 1501532023
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "微信", id: 836500024
mas "超级右键", id: 1497428978
